<details><summary>Show OpenTofu Plan</summary>

```


OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # openstack_compute_instance_v2.testinstance11 will be created
  + resource "openstack_compute_instance_v2" "testinstance11" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + created             = (known after apply)
      + flavor_id           = "41f0ea41-75ca-44a6-be66-bb56b2a90721"
      + flavor_name         = (known after apply)
      + force_delete        = false
      + hypervisor_hostname = (known after apply)
      + id                  = (known after apply)
      + image_id            = "01b13195-260c-4c8f-8378-8f5aa5344ede"
      + image_name          = (known after apply)
      + name                = "accounts-testinstance11"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "accounts-application",
          + "accounts-default",
        ]
      + stop_before_destroy = false
      + updated             = (known after apply)

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + mac            = (known after apply)
          + name           = (known after apply)
          + port           = (known after apply)
          + uuid           = "d8a16ddf-c01f-4f22-8b67-8ed18b4b1b45"
        }
    }

  # openstack_compute_instance_v2.testinstance11_legacy will be created
  + resource "openstack_compute_instance_v2" "testinstance11_legacy" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + created             = (known after apply)
      + flavor_id           = "41f0ea41-75ca-44a6-be66-bb56b2a90721"
      + flavor_name         = (known after apply)
      + force_delete        = false
      + hypervisor_hostname = (known after apply)
      + id                  = (known after apply)
      + image_id            = "01b13195-260c-4c8f-8378-8f5aa5344ede"
      + image_name          = (known after apply)
      + name                = "accounts-testinstance11-legacy"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "accounts-application",
          + "accounts-default",
        ]
      + stop_before_destroy = false
      + updated             = (known after apply)

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + mac            = (known after apply)
          + name           = (known after apply)
          + port           = (known after apply)
          + uuid           = "7425e328-560c-4f00-8e99-706f3fb90bb4"
        }
    }

  # openstack_compute_instance_v2.testinstance12 will be created
  + resource "openstack_compute_instance_v2" "testinstance12" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + created             = (known after apply)
      + flavor_id           = "41f0ea41-75ca-44a6-be66-bb56b2a90721"
      + flavor_name         = (known after apply)
      + force_delete        = false
      + hypervisor_hostname = (known after apply)
      + id                  = (known after apply)
      + image_id            = "f10bb6a3-765b-48fa-9bb2-cc9b9b29d3ac"
      + image_name          = (known after apply)
      + name                = "accounts-testinstance12"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "accounts-application",
          + "accounts-default",
        ]
      + stop_before_destroy = false
      + updated             = (known after apply)

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + mac            = (known after apply)
          + name           = (known after apply)
          + port           = (known after apply)
          + uuid           = "d8a16ddf-c01f-4f22-8b67-8ed18b4b1b45"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @stwalkerster, Action: `pull_request`*